## Connect to DB

In [2]:
import MySQLdb

mydb = MySQLdb.connect(host='127.0.0.1', port=3306, user='hammurabi', passwd='*********', db='lahman2014',
                       connect_timeout=6000)
cur = mydb.cursor()

## SQL command

In [4]:
statement = """SHOW TABLES"""
command = cur.execute(statement)
db_tables = cur.fetchall()

In [10]:
print db_tables

(('allstarfull',), ('appearances',), ('awardsmanagers',), ('awardsplayers',), ('awardssharemanagers',), ('awardsshareplayers',), ('batting',), ('battingpost',), ('collegeplaying',), ('fielding',), ('fieldingof',), ('fieldingpost',), ('halloffame',), ('managers',), ('managershalf',), ('master',), ('pitching',), ('pitchingpost',), ('salaries',), ('schools',), ('seriespost',), ('teams',), ('teamsfranchises',), ('teamshalf',))

In [11]:
print db_tables[0][0]

allstarfull

In [12]:
import pandas as pd

# table_allstarfull = pd.read_sql("SELECT * FROM allstarfull;", con=mydb)
table_allstarfull = pd.read_sql("SELECT * FROM allstarfull;", con=mydb, index_col='playerID')
table_master = pd.read_sql("SELECT * FROM master;", con=mydb, index_col='playerID')

In [13]:
table_allstarfull.head()

,yearID,gameNum,gameID,teamID,lgID,GP,startingPos
playerID,,,,,,,
aaronha01,1955,0,NLS195507120,ML1,NL,1,NaN
aaronha01,1956,0,ALS195607100,ML1,NL,1,NaN
aaronha01,1957,0,NLS195707090,ML1,NL,1,9
aaronha01,1958,0,ALS195807080,ML1,NL,1,9
aaronha01,1959,1,NLS195907070,ML1,NL,1,9

In [57]:
table_allstarfull.tail()

,yearID,gameNum,gameID,teamID,lgID,GP,startingPos
playerID,,,,,,,
zitoba01,2002,0,NLS200207090,OAK,AL,1,NaN
zitoba01,2003,0,ALS200307150,OAK,AL,0,NaN
zitoba01,2006,0,NLS200607110,OAK,AL,1,NaN
zobribe01,2009,0,NLS200907140,TBA,AL,1,NaN
zobribe01,2013,0,NLS201307160,TBA,AL,0,NaN

In [58]:
table_allstarfull.count()

yearID         4993
gameNum        4993
gameID         4944
teamID         4993
lgID           4993
GP             4993
startingPos    1560
dtype: int64

In [59]:
table_allstarfull[0:10]

,yearID,gameNum,gameID,teamID,lgID,GP,startingPos
playerID,,,,,,,
aaronha01,1955,0,NLS195507120,ML1,NL,1,NaN
aaronha01,1956,0,ALS195607100,ML1,NL,1,NaN
aaronha01,1957,0,NLS195707090,ML1,NL,1,9
aaronha01,1958,0,ALS195807080,ML1,NL,1,9
aaronha01,1959,1,NLS195907070,ML1,NL,1,9
aaronha01,1959,2,NLS195908030,ML1,NL,1,9
aaronha01,1960,1,ALS196007110,ML1,NL,1,9
aaronha01,1960,2,ALS196007130,ML1,NL,1,9
aaronha01,1961,1,NLS196107110,ML1,NL,1,NaN
aaronha01,1961,2,ALS196107310,ML1,NL,1,NaN

In [60]:
table_allstarfull.columns

Index([u'yearID', u'gameNum', u'gameID', u'teamID', u'lgID', u'GP',
       u'startingPos'],
      dtype='object')

In [61]:
table_allstarfull.loc['aaronha01'][:10]

,yearID,gameNum,gameID,teamID,lgID,GP,startingPos
playerID,,,,,,,
aaronha01,1955,0,NLS195507120,ML1,NL,1,NaN
aaronha01,1956,0,ALS195607100,ML1,NL,1,NaN
aaronha01,1957,0,NLS195707090,ML1,NL,1,9
aaronha01,1958,0,ALS195807080,ML1,NL,1,9
aaronha01,1959,1,NLS195907070,ML1,NL,1,9
aaronha01,1959,2,NLS195908030,ML1,NL,1,9
aaronha01,1960,1,ALS196007110,ML1,NL,1,9
aaronha01,1960,2,ALS196007130,ML1,NL,1,9
aaronha01,1961,1,NLS196107110,ML1,NL,1,NaN
aaronha01,1961,2,ALS196107310,ML1,NL,1,NaN

In [62]:
table_allstarfull['yearID'][:10]

playerID
aaronha01    1955
aaronha01    1956
aaronha01    1957
aaronha01    1958
aaronha01    1959
aaronha01    1959
aaronha01    1960
aaronha01    1960
aaronha01    1961
aaronha01    1961
Name: yearID, dtype: int64

In [63]:
table_allstarfull.yearID[:10]

playerID
aaronha01    1955
aaronha01    1956
aaronha01    1957
aaronha01    1958
aaronha01    1959
aaronha01    1959
aaronha01    1960
aaronha01    1960
aaronha01    1961
aaronha01    1961
Name: yearID, dtype: int64

In [66]:
table_master.head()

,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,deathCountry,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
playerID,,,,,,,,,,,,,,,,,,,,,
aardsda01,1981,12,27,USA,CO,Denver,NaN,NaN,NaN,None,...,Aardsma,David Allan,205,75,R,R,2004-04-06,2013-09-28,aardd001,aardsda01
aaronha01,1934,2,5,USA,AL,Mobile,NaN,NaN,NaN,None,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
aaronto01,1939,8,5,USA,AL,Mobile,1984,8,16,USA,...,Aaron,Tommie Lee,190,75,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
aasedo01,1954,9,8,USA,CA,Orange,NaN,NaN,NaN,None,...,Aase,Donald William,190,75,R,R,1977-07-26,1990-10-03,aased001,aasedo01
abadan01,1972,8,25,USA,FL,Palm Beach,NaN,NaN,NaN,None,...,Abad,Fausto Andres,184,73,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [74]:
table_allstarfull2 = pd.read_sql("SELECT * FROM allstarfull;", con=mydb)
table_master2 = pd.read_sql("SELECT * FROM master;", con=mydb)

In [75]:
table_allstarfull2.columns

Index([u'playerID', u'yearID', u'gameNum', u'gameID', u'teamID', u'lgID',
       u'GP', u'startingPos'],
      dtype='object')

In [76]:
table_master2.columns

Index([u'playerID', u'birthYear', u'birthMonth', u'birthDay', u'birthCountry',
       u'birthState', u'birthCity', u'deathYear', u'deathMonth', u'deathDay',
       u'deathCountry', u'deathState', u'deathCity', u'nameFirst', u'nameLast',
       u'nameGiven', u'weight', u'height', u'bats', u'throws', u'debut',
       u'finalGame', u'retroID', u'bbrefID'],
      dtype='object')

In [77]:
table_merge = table_allstarfull2

In [79]:
table_merge = table_merge.merge(table_master2)

In [80]:
table_merge.columns

Index([u'playerID', u'yearID', u'gameNum', u'gameID', u'teamID', u'lgID',
       u'GP', u'startingPos', u'birthYear', u'birthMonth', u'birthDay',
       u'birthCountry', u'birthState', u'birthCity', u'deathYear',
       u'deathMonth', u'deathDay', u'deathCountry', u'deathState',
       u'deathCity', u'nameFirst', u'nameLast', u'nameGiven', u'weight',
       u'height', u'bats', u'throws', u'debut', u'finalGame', u'retroID',
       u'bbrefID'],
      dtype='object')

In [81]:
len(table_merge.columns)

31

In [91]:
pd.set_option('display.max_columns', 20)

In [92]:
table_merge.head()

,playerID,yearID,gameNum,gameID,teamID,lgID,GP,startingPos,birthYear,birthMonth,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aaronha01,1955,0,NLS195507120,ML1,NL,1,NaN,1934,2,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
1,aaronha01,1956,0,ALS195607100,ML1,NL,1,NaN,1934,2,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronha01,1957,0,NLS195707090,ML1,NL,1,9,1934,2,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
3,aaronha01,1958,0,ALS195807080,ML1,NL,1,9,1934,2,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
4,aaronha01,1959,1,NLS195907070,ML1,NL,1,9,1934,2,...,Aaron,Henry Louis,180,72,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01

## Close Connection

In [14]:
cur.close()
mydb.commit()
mydb.close()